Revit 2027 API
PanelScheduleView.GetCellsBySlotNumber Method
 Gets cells for the given slot number
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void GetCellsBySlotNumber(
	int nSlotNumber,
	out IList<int> RowArr,
	out IList<int> ColArr
)
Public Sub GetCellsBySlotNumber (
	nSlotNumber As Integer,
	<OutAttribute> ByRef RowArr As IList(Of Integer),
	<OutAttribute> ByRef ColArr As IList(Of Integer)
)
public:
void GetCellsBySlotNumber(
	int nSlotNumber,
	[OutAttribute] IList<int>^% RowArr,
	[OutAttribute] IList<int>^% ColArr
)
member GetCellsBySlotNumber :
        nSlotNumber : int *
        RowArr : IList<int> byref *
        ColArr : IList<int> byref -> unit
Parameters
nSlotNumber Int32
 Slot Number
RowArr IList<Int32>
 The array of Row Number
ColArr IList<Int32>
 The array of Col Number
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace